tinko26/ao/src/ao_sys_xc32_pic32_can/ao_can_3.h
#ifndef AO_CAN_FILTER_EID_3_0

#define AO_CAN_FILTER_EID_3_0           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_0

#define AO_CAN_FILTER_ENABLE_3_0        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_0

#define AO_CAN_FILTER_FIFO_3_0          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_0

#define AO_CAN_FILTER_IDE_3_0           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_0

#define AO_CAN_FILTER_MASK_3_0          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_0

#define AO_CAN_FILTER_SID_3_0           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_1

#define AO_CAN_FILTER_EID_3_1           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_1

#define AO_CAN_FILTER_ENABLE_3_1        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_1

#define AO_CAN_FILTER_FIFO_3_1          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_1

#define AO_CAN_FILTER_IDE_3_1           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_1

#define AO_CAN_FILTER_MASK_3_1          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_1

#define AO_CAN_FILTER_SID_3_1           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_2

#define AO_CAN_FILTER_EID_3_2           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_2

#define AO_CAN_FILTER_ENABLE_3_2        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_2

#define AO_CAN_FILTER_FIFO_3_2          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_2

#define AO_CAN_FILTER_IDE_3_2           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_2

#define AO_CAN_FILTER_MASK_3_2          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_2

#define AO_CAN_FILTER_SID_3_2           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_3

#define AO_CAN_FILTER_EID_3_3           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_3

#define AO_CAN_FILTER_ENABLE_3_3        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_3

#define AO_CAN_FILTER_FIFO_3_3          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_3

#define AO_CAN_FILTER_IDE_3_3           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_3

#define AO_CAN_FILTER_MASK_3_3          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_3

#define AO_CAN_FILTER_SID_3_3           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_4

#define AO_CAN_FILTER_EID_3_4           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_4

#define AO_CAN_FILTER_ENABLE_3_4        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_4

#define AO_CAN_FILTER_FIFO_3_4          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_4

#define AO_CAN_FILTER_IDE_3_4           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_4

#define AO_CAN_FILTER_MASK_3_4          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_4

#define AO_CAN_FILTER_SID_3_4           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_5

#define AO_CAN_FILTER_EID_3_5           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_5

#define AO_CAN_FILTER_ENABLE_3_5        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_5

#define AO_CAN_FILTER_FIFO_3_5          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_5

#define AO_CAN_FILTER_IDE_3_5           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_5

#define AO_CAN_FILTER_MASK_3_5          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_5

#define AO_CAN_FILTER_SID_3_5           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_6

#define AO_CAN_FILTER_EID_3_6           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_6

#define AO_CAN_FILTER_ENABLE_3_6        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_6

#define AO_CAN_FILTER_FIFO_3_6          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_6

#define AO_CAN_FILTER_IDE_3_6           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_6

#define AO_CAN_FILTER_MASK_3_6          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_6

#define AO_CAN_FILTER_SID_3_6           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_7

#define AO_CAN_FILTER_EID_3_7           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_7

#define AO_CAN_FILTER_ENABLE_3_7        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_7

#define AO_CAN_FILTER_FIFO_3_7          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_7

#define AO_CAN_FILTER_IDE_3_7           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_7

#define AO_CAN_FILTER_MASK_3_7          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_7

#define AO_CAN_FILTER_SID_3_7           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_8

#define AO_CAN_FILTER_EID_3_8           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_8

#define AO_CAN_FILTER_ENABLE_3_8        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_8

#define AO_CAN_FILTER_FIFO_3_8          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_8

#define AO_CAN_FILTER_IDE_3_8           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_8

#define AO_CAN_FILTER_MASK_3_8          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_8

#define AO_CAN_FILTER_SID_3_8           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_9

#define AO_CAN_FILTER_EID_3_9           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_9

#define AO_CAN_FILTER_ENABLE_3_9        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_9

#define AO_CAN_FILTER_FIFO_3_9          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_9

#define AO_CAN_FILTER_IDE_3_9           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_9

#define AO_CAN_FILTER_MASK_3_9          (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_9

#define AO_CAN_FILTER_SID_3_9           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_10

#define AO_CAN_FILTER_EID_3_10          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_10

#define AO_CAN_FILTER_ENABLE_3_10       (false)

#endif

