tinko26/ao/src/ao_sys_xc32_pic32_can/ao_can_3.h
#define AO_CAN_FILTER_SID_3_30          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_31

#define AO_CAN_FILTER_EID_3_31          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_31

#define AO_CAN_FILTER_ENABLE_3_31       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_31

#define AO_CAN_FILTER_FIFO_3_31         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_31

#define AO_CAN_FILTER_IDE_3_31          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_31

#define AO_CAN_FILTER_MASK_3_31         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_31

#define AO_CAN_FILTER_SID_3_31          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_3_0

#define AO_CAN_FILTER_MASK_EID_3_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_3_0

#define AO_CAN_FILTER_MASK_IDE_3_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_3_0

#define AO_CAN_FILTER_MASK_SID_3_0      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_3_1

#define AO_CAN_FILTER_MASK_EID_3_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_3_1

#define AO_CAN_FILTER_MASK_IDE_3_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_3_1

#define AO_CAN_FILTER_MASK_SID_3_1      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_3_2

#define AO_CAN_FILTER_MASK_EID_3_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_3_2

#define AO_CAN_FILTER_MASK_IDE_3_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_3_2

#define AO_CAN_FILTER_MASK_SID_3_2      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_3_3

#define AO_CAN_FILTER_MASK_EID_3_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_3_3

#define AO_CAN_FILTER_MASK_IDE_3_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_3_3

#define AO_CAN_FILTER_MASK_SID_3_3      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_INVALID_3

#define AO_CAN_INVALID_3                (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_MODE_3

#define AO_CAN_MODE_3                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_OVERFLOW_3

#define AO_CAN_OVERFLOW_3               (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_RX_3

#define AO_CAN_RX_3                     ((AO_CAN_FIFOS_RX_3) > 0 ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SENT_3

#define AO_CAN_SENT_3                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SYSTEM_3

#define AO_CAN_SYSTEM_3                 (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TIMER_3

#define AO_CAN_TIMER_3                  (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TX_3

#define AO_CAN_TX_3                     ((AO_CAN_FIFOS_TX_3) > 0 ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_UNDERFLOW_3

#define AO_CAN_UNDERFLOW_3              (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_WAKE_UP_3

#define AO_CAN_WAKE_UP_3                (false)

#endif

// ----------------------------------------------------------------------------

extern  ao_can_t                        ao_can_buffers_3[AO_CAN_BUFFERS_3];

extern  ao_send_obj_t                   ao_can_in_3     [AO_CAN_FIFOS_RX_3];

extern  ao_recv_obj_t                   ao_can_out_3    [AO_CAN_FIFOS_TX_3];

extern  ao_task_t                       ao_can_task_3;

// ----------------------------------------------------------------------------

// This event is raised, when there is an error on the CAN bus.

// This event is raised every time there is a change in the current error state
// of the CAN module with respect to the CAN network.

// The error states are tracked by the CxTREC register.

// ----------------------------------------------------------------------------

void    ao_can_bus_3(                   ao_can_bus_info_t const * info);

// ----------------------------------------------------------------------------

void    ao_can_config_3();

void    ao_can_config_baud_3();

void    ao_can_config_fifos_3();

void    ao_can_config_filter_masks_3();

void    ao_can_config_filters_3();

// ----------------------------------------------------------------------------

// This event occurs, when there was an error in the last received message or
// transmitted message.

// However, the specific error is not available to the user application.

// ----------------------------------------------------------------------------

void    ao_can_invalid_3(               ao_can_invalid_info_t const * info);

// ----------------------------------------------------------------------------

void    ao_can_listen_all_3();

// ----------------------------------------------------------------------------

void    ao_can_listen_only_3();

// ----------------------------------------------------------------------------

void    ao_can_loopback_3();

// ----------------------------------------------------------------------------

// This event occurs upon an operation mode change.

// ----------------------------------------------------------------------------

void    ao_can_mode_3(                  ao_can_mode_info_t const * info);

// ----------------------------------------------------------------------------

void    ao_can_normal_3();

// ----------------------------------------------------------------------------

// This event occurs, when a message has been received, but the designated
// fifo is full.

// ----------------------------------------------------------------------------

void    ao_can_overflow_3(              ao_can_overflow_info_t const * info);

// ----------------------------------------------------------------------------

#ifndef ao_can_reg_3

