tinko26/ao/src/ao_sys_xc32_pic32_can/ao_can_3.h
#define ao_can_reg_3()                  ((ao_can_reg_t *) (_CAN3_BASE_ADDRESS))

#endif

// ----------------------------------------------------------------------------

// This event occurs, when all messages in a fifo have been transmitted.

// ----------------------------------------------------------------------------

void    ao_can_sent_3(                  ao_can_sent_info_t const * info);

// ----------------------------------------------------------------------------

void    ao_can_start_3();

void    ao_can_stop_3();

// ----------------------------------------------------------------------------

// This event occurs due to two types of errors, addressing errors and
// bandwidth errors.

// Both of these errors are fatal. After the event was raised, the CAN module
// will be stopped and started over again.

// An addressing error will occur, if the CAN module attempts to access a
// restricted memory location. Most likely, this results from

// * an invalid fifo base address, or

// * an invalid configuration of the fifo sizes in the CxFIFOCONi registers.

// A bandwidth error will occur, when the CAN module is unable to write a
// received message to memory before the next message arrives. Most likely,
// this results from the CAN interrupt being delayed for a too long period of
// time.

// ----------------------------------------------------------------------------

void    ao_can_system_3(                ao_can_system_info_t const * info);

// ----------------------------------------------------------------------------

// This event occurs, when the CAN timestamp timer overflows.

// ----------------------------------------------------------------------------

void    ao_can_timer_3(                 ao_can_timer_info_t const * info);

// ----------------------------------------------------------------------------

// This event occurs, when a remote transmission request (RTR) has been
// received, but the designated fifo to respond automatically is empty.

// ----------------------------------------------------------------------------

void    ao_can_underflow_3(             ao_can_underflow_info_t const * info);

// ----------------------------------------------------------------------------

// This event is raised, when activity is detected on the CAN bus while the
// CAN module is in sleep mode.

// ----------------------------------------------------------------------------

void    ao_can_wake_up_3(               ao_can_wake_up_info_t const * info);

// ----------------------------------------------------------------------------
